content/it/docs/80 Progetti/ProgettoMipaf/Esempi di XML per la modalita_web-service/Sostanze Zuccherine/Sincroni/VisOperSiRSoZ.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:soap="http://cooperazione.sian.it/schema/SoapAutenticazione" xmlns:wsm="http://cooperazione.sian.it/schema/wsmrgc/">
   <soapenv:Header>
      <soap:SOAPAutenticazione>
         <!--Credenziali rilasciate dal Ministero all'azienda-->
         <username>AAAAAAAAAA</username>
         <password>BBBBBBBBBB</password>
         <nomeServizio>VisOperSiRSoZ</nomeServizio>
      </soap:SOAPAutenticazione>
   </soapenv:Header>
   <soapenv:Body>
      <wsm:VisOperSiRSoZInput>
         <wsm:CodOper>
            <!--Indicazione del Codice Fiscale dell'azienda (valorizzare persona fisica o giuridica)-->
            <wsm:PersonaFisica>RSSMRA59M08H501S</wsm:PersonaFisica>
         </wsm:CodOper>
         <!--Codice ICQRF dello stabilimento nel formato AANNNN-->
         <wsm:CodiceIcqrf>RM1234</wsm:CodiceIcqrf>
         <!--Data di inizio nel formato AAAA-MM-GG-->
         <wsm:DataOperIni>2015-01-12</wsm:DataOperIni>
         <!--Data di fine nel formato AAAA-MM-GG-->
         <wsm:DataOperFine>2015-11-04</wsm:DataOperFine>
         <!--Codice alfanumerico identificativo del soggetto censito in ANAGRAFICA-->
         <wsm:CodiceSoggetto>1616</wsm:CodiceSoggetto>
         <!--Codice dell'operazione di registro-->
         <wsm:CodOperazione>GIZU</wsm:CodOperazione>
         <!--Codice della sostanza zuccherina 1-Saccarosio 2-Glucosio 3-Isoglucosio 4-Saccarosio in soluzione 5-Glucosio in soluzione 6-Isoglucosio in soluzione-->
         <wsm:Prodotto>1</wsm:Prodotto>
      </wsm:VisOperSiRSoZInput>
   </soapenv:Body>
</soapenv:Envelope>